In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1, s2, s3)

0     2
1     3
2     2
3     2
4     3
     ..
95    1
96    3
97    1
98    4
99    4
Length: 100, dtype: int64 0     1
1     3
2     3
3     1
4     1
     ..
95    2
96    1
97    2
98    3
99    3
Length: 100, dtype: int64 0     11230
1     16078
2     23177
3     15737
4     25819
      ...
95    20984
96    19795
97    28891
98    17845
99    28160
Length: 100, dtype: int64

In [5]:
#create a DataFrame by joining the series by column
housemkt = pd.concat([s1,s2,s3],axis=1)
housemkt.head()

   0  1      2
0  2  1  11230
1  3  3  16078
2  2  3  23177
3  2  1  15737
4  3  1  25819

In [8]:
housemkt.rename(columns = {0:'bedrs', 1:'bathrs',2:'price_sqr_meter'}, inplace = True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      2       1            11230
1      3       3            16078
2      2       3            23177
3      2       1            15737
4      3       1            25819

In [9]:
#join concat the values
bigcolumn = pd.concat([s1, s2, s3],axis=0)
bigcolumn

0         2
1         3
2         2
3         2
4         3
      ...
95    20984
96    19795
97    28891
98    17845
99    28160
Length: 300, dtype: int64

In [11]:
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       3
2       2
3       2
4       3
..    ...
95  20984
96  19795
97  28891
98  17845
99  28160

[300 rows x 1 columns]

In [12]:
len(bigcolumn)

300

In [15]:
#reindex the dataframe
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        3
2        2
3        2
4        3
..     ...
295  20984
296  19795
297  28891
298  17845
299  28160

[300 rows x 1 columns]